xdu-aero-association/FM33LC0XX_Example_0.04/RTC 读写时间/Drivers/FM33LC0xx_LL_Driver/Src/fm33lc0xx_ll_gptim.c
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_ll_gptim.c
  * @author  FMSH Application Team
  * @brief   Src file of GPTIM LL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "fm33lc0xx_ll_rcc.h"
#include "fm33lc0xx_ll_rmu.h"
#include "fm33lc0xx_ll_gptim.h"
#include "fm33_assert.h"

/** @addtogroup FM33LC0xx_LL_Driver_GPTIM
  * @{
  */
  
  
/** @addtogroup TIM_LL_Private_Macros
  * @{
  */


#define IS_GPTIM_INSTANCE(TIMx)                     (((TIMx) == GPTIM0) \
                                                        ||((TIMx) == GPTIM1))

#define IS_LL_GPTIM_COUNTERMODE(__VALUE__)          (((__VALUE__) == LL_GPTIM_COUNTER_DIRECT_UP) \
                                                       || ((__VALUE__) == LL_GPTIM_COUNTER_DIRECT_DOWN) \
                                                       || ((__VALUE__) == LL_GPTIM_COUNTER_ALIGNED_CENTER_DOWN   ) \
                                                       || ((__VALUE__) == LL_GPTIM_COUNTER_ALIGNED_CENTER_UP     ) \
                                                       || ((__VALUE__) == LL_GPTIM_COUNTER_ALIGNED_CENTER_UP_DOWN))

#define IS_LL_GPTIM_CLOCKDIVISION(__VALUE__)        (((__VALUE__) == LL_GPTIM_CLOCKDIVISION_DIV1) \
                                                     || ((__VALUE__) == LL_GPTIM_CLOCKDIVISION_DIV2) \
                                                     || ((__VALUE__) == LL_GPTIM_CLOCKDIVISION_DIV4))


#define IS_LL_GPTIM_CC_MODE(__VALUE__)               (((__VALUE__) ==   LL_GPTIM_CC_MODE_OUTPUT) \
                                                       ||((__VALUE__) == LL_GPTIM_CC1_MODE_INPUT_TI1) \
                                                       || ((__VALUE__) == LL_GPTIM_CC1_MODE_INPUT_TI2) \
                                                       || ((__VALUE__) == LL_GPTIM_CC2_MODE_INPUT_TI2) \
                                                       || ((__VALUE__) == LL_GPTIM_CC2_MODE_INPUT_TI1) \
                                                       || ((__VALUE__) == LL_GPTIM_CC3_MODE_INPUT_TI3) \
                                                       || ((__VALUE__) == LL_GPTIM_CC3_MODE_INPUT_TI4) \
                                                       || ((__VALUE__) == LL_GPTIM_CC4_MODE_INPUT_TI3) \
                                                       || ((__VALUE__) == LL_GPTIM_CC4_MODE_INPUT_TI4) \
                                                       || ((__VALUE__) == LL_GPTIM_CC_MODE_INPUT_TRC))
                                      
#define IS_LL_GPTIM_IC_FILTER(__VALUE__)            (((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV1) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV1_N2) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV1_N4) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV1_N8) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV2_N6) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV2_N8) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV4_N6) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV4_N8) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV8_N6) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV8_N8) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV16_N5) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV16_N6) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV16_N8) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV32_N5) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV32_N6) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_FILTER_FDIV32_N8))

#define IS_LL_GPTIM_CHANNEL(__VALUE__)              (((__VALUE__) == LL_GPTIM_CHANNEL_1)\
                                                    || ((__VALUE__) == LL_GPTIM_CHANNEL_2)\
                                                    || ((__VALUE__) == LL_GPTIM_CHANNEL_3)\
                                                    || ((__VALUE__) == LL_GPTIM_CHANNEL_4))
                                        
                                        
                                        
#define IS_LL_GPTIM_SLAVE_MODE(__VALUE__)           (((__VALUE__) == LL_GPTIM_SLAVE_MODE_PROHIBITED)\
                                                    || ((__VALUE__) == LL_GPTIM_SLAVE_MODE_TI1FP1_TI2FP2_CNT)\
                                                    || ((__VALUE__) == LL_GPTIM_SLAVE_MODE_TI2FP2_TI1FP1_CNT)\
                                                    || ((__VALUE__) == LL_GPTIM_SLAVE_MODE_TI2FP2_CNT_TI1FP1_CNT)\
                                                    || ((__VALUE__) == LL_GPTIM_SLAVE_MODE_TRGI_RISE_RST)\
                                                    || ((__VALUE__) == LL_GPTIM_SLAVE_MODE_TRGI_HIGH_RUN)\
                                                    || ((__VALUE__) == LL_GPTIM_SLAVE_MODE_TRGI_RISE_RUN)\
                                                    || ((__VALUE__) == LL_GPTIM_SLAVE_MODE_TRGI_CLK))


#define IS_LL_GPTIM_TRIGGER_SRC(__VALUE__)          (((__VALUE__) ==LL_GPTIM_TIM_TS_ITR0 )\
                                                        ||((__VALUE__) ==LL_GPTIM_TIM_TS_ITR1 )\
                                                        ||((__VALUE__) ==LL_GPTIM_TIM_TS_ITR2)\
                                                        ||((__VALUE__) ==LL_GPTIM_TIM_TS_ITR3)\
                                                        ||((__VALUE__) ==LL_GPTIM_TIM_TS_TI1F_ED)\
                                                        ||((__VALUE__) ==LL_GPTIM_TIM_TS_TI1FP1)\
                                                        ||((__VALUE__) ==LL_GPTIM_TIM_TS_TI2FP1)\
                                                        ||((__VALUE__) ==LL_GPTIM_TIM_TS_ETRF))    



#define IS_LL_GPTIM_ETP_FILTER(__VALUE__)           (((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV1) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV1_N2) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV1_N4) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV1_N8) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV2_N6) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV2_N8) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV4_N6) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV4_N8) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV8_N6) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV8_N8) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV16_N5) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV16_N6) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV16_N8) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV32_N5) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV32_N6) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_FILTER_FDIV32_N8))


#define IS_LL_GPTIM_ETR_PSC(__VALUE__)               (((__VALUE__) == LL_GPTIM_ETR_PRESCALER_DIV1) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_PRESCALER_DIV2) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_PRESCALER_DIV4) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_PRESCALER_DIV8))
                                 
                                 

#define IS_LL_GPTIM_ETR_POLARITY(__VALUE__)         (((__VALUE__) == LL_GPTIM_ETR_POLARITY_NONINVERTED) \
                                                     || ((__VALUE__) == LL_GPTIM_ETR_POLARITY_NINVERTED)) 

                                   
