xdu-aero-association/FM33LC0XX_Example_0.04/RTC 读写时间/Drivers/FM33LC0xx_LL_Driver/Src/fm33lc0xx_ll_gptim.c
#define IS_LL_GPTIM_OCPOLARITY(__VALUE__)           (((__VALUE__) == LL_GPTIM_OC_POLARITY_NOMAL) \
                                                    || ((__VALUE__) == LL_GPTIM_OC_POLARITY_REVERSE))
                                                    
#define IS_LL_GPTIM_IC_POLARITY(__VALUE__)          (((__VALUE__) == LL_GPTIM_IC_POLARITY_RISING) \
                                                       || ((__VALUE__) == LL_GPTIM_IC_POLARITY_FALLING))
    
                                       
 
#define IS_LL_GPTIM_IC_PRESCALER(__VALUE__)         (((__VALUE__) == LL_GPTIM_IC_PRESCALER_DIV_1) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_PRESCALER_DIV_2) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_PRESCALER_DIV_4) \
                                                     || ((__VALUE__) == LL_GPTIM_IC_PRESCALER_DIV_8))


#define IS_LL_GPTIM_IC_ACTIVEINPUT(__VALUE__)          (((__VALUE__) == LL_GPTIM_CC1_MODE_INPUT_TI1) \
                                                       || ((__VALUE__) == LL_GPTIM_CC1_MODE_INPUT_TI2) \
                                                       || ((__VALUE__) == LL_GPTIM_CC2_MODE_INPUT_TI2) \
                                                       || ((__VALUE__) == LL_GPTIM_CC2_MODE_INPUT_TI1) \
                                                       || ((__VALUE__) == LL_GPTIM_CC3_MODE_INPUT_TI3) \
                                                       || ((__VALUE__) == LL_GPTIM_CC3_MODE_INPUT_TI4) \
                                                       || ((__VALUE__) == LL_GPTIM_CC4_MODE_INPUT_TI3) \
                                                       || ((__VALUE__) == LL_GPTIM_CC4_MODE_INPUT_TI4) \
                                                       || ((__VALUE__) == LL_GPTIM_CC_MODE_INPUT_TRC))
                                                       
#define IS_LL_GPTIM_OC_POLARITY(__VALUE__)          (((__VALUE__) == LL_GPTIM_OC_POLARITY_NOMAL) \
                                                    || ((__VALUE__) == LL_GPTIM_OC_POLARITY_REVERSE))



#define IS_LL_GPTIM_OC_MODE(__VALUE__)               (((__VALUE__) ==   LL_GPTIM_OC_MODE_FROZEN) \
                                                      || ((__VALUE__) == LL_GPTIM_OC_MODE_ACTIVE) \
                                                      || ((__VALUE__) == LL_GPTIM_OC_MODE_INACTIVE) \
                                                      || ((__VALUE__) == LL_GPTIM_OC_MODE_TOGGLE) \
                                                      || ((__VALUE__) == LL_GPTIM_OC_MODE_FORCED_INACTIVE) \
                                                      || ((__VALUE__) == LL_GPTIM_OC_MODE_FORCED_ACTIVE) \
                                                      || ((__VALUE__) == LL_GPTIM_OC_MODE_PWM1) \
                                                      || ((__VALUE__) == LL_GPTIM_OC_MODE_PWM2))
                                                      
#define IS_LL_GPTIM_OC_FASTMODE(__VALUE__)          (((__VALUE__) == ENABLE) \
                                                    || ((__VALUE__) == DISABLE))

#define IS_LL_GPTIM_OC_PRELOAD(__VALUE__)           (((__VALUE__) == ENABLE) \
                                                    || ((__VALUE__) == DISABLE))
                                                    
#define IS_LL_GPTIM_OC_ETR_CLEARN(__VALUE__)        (((__VALUE__) == ENABLE) \
                                                    || ((__VALUE__) == DISABLE)) 
     

#define IS_LL_GPTIM_TRIGGER_DELAY(__VALUE__)       (((__VALUE__) == DISABLE) \
                                                    || ((__VALUE__) == ENABLE))
                                                        
                                                        
#define IS_LL_GPTIM_IC_CAPTURE_STATE(__VALUE__)    (((__VALUE__) == DISABLE) \
                                                     || ((__VALUE__) == ENABLE))                                                        
/**
  * @}
  */


/* Private function prototypes -----------------------------------------------*/
/** @defgroup TIM_LL_Private_Functions TIM Private Functions
  * @{
  */
static ErrorStatus  OCConfig(GPTIM_Type *TIMx, uint32_t Channel, LL_GPTIM_OC_InitTypeDef *TIM_OC_InitStruct );
static ErrorStatus  SetITRxInputSrc(GPTIM_Type *TIMx,uint32_t ITRx,uint32_t ITRx_Src);
/**
  * @}
  */

/** @addtogroup TIM_LL_EF_Init
  * @{
  */

/**
  * @brief  复位对应GPTIMx寄存器.
  * @param  GPTIMx 
  * @retval ErrorStatus枚举值:
  *       	-PASS 外设寄存器值恢复复位值
  *       	-FAIL 未成功执行
  */
ErrorStatus LL_GPTIM_DeInit(GPTIM_Type *TIMx)
{
    ErrorStatus result = PASS;

    /* Check the parameters */
    assert_param(IS_GPTIM_INSTANCE(TIMx));
    /* 使能外设复位 */
    LL_RCC_EnablePeripheralReset();
    if(TIMx == GPTIM0)
    {
        /* 使能外设复位 */
        LL_RCC_EnableResetAPB2Peripheral(LL_RCC_APB1_PERIPHERAL_RST_GTTIM0);
        LL_RCC_DisableResetAPB2Peripheral(LL_RCC_APB1_PERIPHERAL_RST_GTTIM0);
        /* 关闭外设时钟 */
        LL_RCC_Group4_DisableBusClock(LL_RCC_BUS4_CLOCK_GTIM0);
    }
    else if(TIMx == GPTIM1)
    {
        /* 使能外设复位 */
        LL_RCC_EnableResetAPB2Peripheral(LL_RCC_APB1_PERIPHERAL_RST_GTTIM1);
        LL_RCC_DisableResetAPB2Peripheral(LL_RCC_APB1_PERIPHERAL_RST_GTTIM1);
        /* 关闭外设时钟 */
        LL_RCC_Group4_DisableBusClock(LL_RCC_BUS4_CLOCK_GTIM1);
    }
    else
    {
        result = FAIL;
    }
    /* 锁定外设复位 */
    LL_RCC_DisablePeripheralReset();
    return result;
}
/**
  * @brief  配置基本定时器时基单元（内部时钟源）.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref LL_GPTIM_InitTypeDef(时基配置结构体)
  * @retval ErrorStatus枚举值	
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
ErrorStatus LL_GPTIM_Init(GPTIM_Type *TIMx, LL_GPTIM_InitTypeDef *TIM_InitStruct)
{

    /* 参数检查 */
    assert_param(IS_GPTIM_INSTANCE(TIMx));
    assert_param(IS_LL_GPTIM_COUNTERMODE(TIM_InitStruct->CounterMode));
    assert_param(IS_LL_GPTIM_CLOCKDIVISION(TIM_InitStruct->ClockDivision));
    /* 时钟总线使能配置 */
    if(TIMx == GPTIM0)
    {
        LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_GTIM0);
    }
    else
    {
        LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_GTIM1);
    }
    /* 计数器计数模式配置 */
    switch(TIM_InitStruct->CounterMode)
    {
        /* 中心对称模式 */
        case LL_GPTIM_COUNTER_ALIGNED_CENTER_DOWN   :   
        case LL_GPTIM_COUNTER_ALIGNED_CENTER_UP     : 
        case LL_GPTIM_COUNTER_ALIGNED_CENTER_UP_DOWN:
        LL_GPTIM_SetCounterAlignedMode(TIMx,TIM_InitStruct->CounterMode);
        break;
        default:
        /* 边沿模式 */
        LL_GPTIM_SetCounterDirection(TIMx,TIM_InitStruct->CounterMode);
        LL_GPTIM_SetCounterAlignedMode(TIMx,LL_GPTIM_COUNTER_ALIGNED_EDGE);
        break;
    }
    /* 自动重装载值 */
    LL_GPTIM_SetAutoReload(TIMx,TIM_InitStruct->Autoreload );
    /* 定时器分频系数与数字滤波器所使用的采样时钟分频比 */
    LL_GPTIM_SetClockDivision(TIMx,TIM_InitStruct->ClockDivision);
    /* 时钟分频 */
    LL_GPTIM_SetPrescaler(TIMx,TIM_InitStruct->Prescaler);
    /* 预装载配置 */
    if(TIM_InitStruct->AutoreloadState == ENABLE)
    {
        LL_GPTIM_EnableARRPreload(TIMx);
    }
    else
    {
        LL_GPTIM_DisableARRPreload(TIMx);
    }
    /* 手动触发更新事件，将配置值写入 */
    LL_GPTIM_GenerateEvent_UPDATE(TIMx);
    
