xdu-aero-association/FM33LC0XX_Example_0.04/RTC 读写时间/Drivers/FM33LC0xx_LL_Driver/Src/fm33lc0xx_ll_gptim.c
    return PASS;
}

/**
  * @brief	设置 LL_GPTIM_InitTypeDef 为默认配置
  * @param 	TIM_InitStruct 指向需要将值设置为默认配置的结构体 @ref LL_GPTIM_InitTypeDef 结构体  
  *         
  * @retval	None
  */
void LL_GPTIM_StructInit(LL_GPTIM_InitTypeDef *TIM_InitStruct)
{
  /* Set the default configuration */
  TIM_InitStruct->Prescaler         = (uint16_t)0x0000;
  TIM_InitStruct->AutoreloadState   = DISABLE;
  TIM_InitStruct->CounterMode       = LL_GPTIM_COUNTER_DIRECT_UP;
  TIM_InitStruct->Autoreload        = 0xFFFFU;
  TIM_InitStruct->ClockDivision     = LL_GPTIM_CLOCKDIVISION_DIV1;
}

/**
  * @brief  配置基本定时器外部时钟源模式，包括编码器模式.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref LL_GPTIM_SlaveInitTypeDef 结构体 
  * @retval ErrorStatus枚举值	
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
ErrorStatus LL_GPTIM_SlaveMode_Init(GPTIM_Type *TIMx, LL_GPTIM_SlaveInitTypeDef *TIM_InitStruct)
{

    
    /* 参数检查 */
    assert_param(IS_GPTIM_INSTANCE(TIMx)); 
    assert_param(IS_LL_GPTIM_SLAVE_MODE(TIM_InitStruct->SlaveMode));
    assert_param(IS_LL_GPTIM_TRIGGER_SRC(TIM_InitStruct->TriggerSrc));
    assert_param(IS_LL_GPTIM_TRIGGER_DELAY(TIM_InitStruct->TriggerDelay));
    /* 时钟总线使能配置 */
    if(TIMx == GPTIM0)
    {
        LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_GTIM0);
    }
    else
    {
        LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_GTIM1);
    }
    /* 触发延迟默认关闭 */
    LL_GPTIM_DisableMasterSlaveMode(TIMx);
    /* 关闭从模式以能写入TS */  
    LL_GPTIM_SetSlaveMode(TIMx,0);
    /* 从模式输入源选择 */
    LL_GPTIM_SetTriggerInput(TIMx,TIM_InitStruct->TriggerSrc);
    /* ITRx 输入源选择 */
    if(TIM_InitStruct->TriggerSrc <= LL_GPTIM_TIM_TS_ITR3)
    {
        /* 内部触发ITRx源选择 */
        SetITRxInputSrc(TIMx,TIM_InitStruct->TriggerSrc,TIM_InitStruct->ITRxSrc);
    }
    /* 从模式选择 */
    LL_GPTIM_SetSlaveMode(TIMx,TIM_InitStruct->SlaveMode);
    /* 触发延迟默认关闭 */
    if(TIM_InitStruct->TriggerDelay == ENABLE)
    {
        LL_GPTIM_EnableMasterSlaveMode(TIMx);
    }
    /* 手动触发更新事件，将配置值写入 */
    LL_GPTIM_GenerateEvent_UPDATE(TIMx);
    return PASS;
}
/**
  * @brief	设置 内部触发源选择配置
  * @param  TIMx Timer Instance
  * @param 	ITRx 内部触发信号源  
  * @param 	ITRx_的源选择不同的ITRx对应的源完全不同，参考芯片手册.
  * @retval	None
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
static ErrorStatus SetITRxInputSrc(GPTIM_Type *TIMx,uint32_t ITRx,uint32_t ITRx_Src)
{
    ErrorStatus result = PASS;
    /* 不同的ITRx对应的输入源不同，这里加以区分*/
    if(TIMx == GPTIM0)
    {
        /* 配置ITRx源 */
        switch(ITRx)
        {
            case LL_GPTIM_TIM_TS_ITR0:
                LL_GPTIM_SetGPTIM0ITR0Input(TIMx,ITRx_Src);
                break;
            case LL_GPTIM_TIM_TS_ITR1:
                LL_GPTIM_SetGPTIM0ITR1Input(TIMx,ITRx_Src);
                break;
            case LL_GPTIM_TIM_TS_ITR2:
                LL_GPTIM_SetGPTIM0ITR2Input(TIMx,ITRx_Src);
                break;
            case LL_GPTIM_TIM_TS_ITR3:
                LL_GPTIM_SetGPTIM0ITR3Input(TIMx,ITRx_Src);
                break;
            default:
                result = FAIL;
                break;
        }
    }
    else
    {
        /* 配置ITRx源 */
        switch(ITRx)
        {
            case LL_GPTIM_TIM_TS_ITR0:
                LL_GPTIM_SetGPTIM1ITR0Input(TIMx,ITRx_Src);
                break;
            case LL_GPTIM_TIM_TS_ITR1:
                LL_GPTIM_SetGPTIM1ITR1Input(TIMx,ITRx_Src);
                break;
            case LL_GPTIM_TIM_TS_ITR2:
                LL_GPTIM_SetGPTIM1ITR2Input(TIMx,ITRx_Src);
                break;
            case LL_GPTIM_TIM_TS_ITR3:
                LL_GPTIM_SetGPTIM1ITR3Input(TIMx,ITRx_Src);
                break;
            default:
                result = FAIL;
                break;
        }    
    }
   return  result;   
}
/**
  * @brief	设置 LL_GPTIM_SlaveInitTypeDef 为默认配置
  * @param 	TIM_InitStruct 指向需要将值设置为默认配置的结构体 @ref LL_GPTIM_SlaveInitTypeDef 结构体  
  *         
  * @retval	None
  */
void LL_GPTIM_SlaveModeStructInit(LL_GPTIM_SlaveInitTypeDef *TIM_InitStruct)
{
    TIM_InitStruct->ITRxSrc       = 0;
    TIM_InitStruct->SlaveMode     = LL_GPTIM_SLAVE_MODE_PROHIBITED;     
    TIM_InitStruct->TriggerSrc    = LL_GPTIM_TIM_TS_TI1FP1;
    TIM_InitStruct->TriggerDelay  = DISABLE;

}
/**
  * @brief  配置TIM触发输入捕获通道ETR.
  * @param  TIMx Timer Instance
  * @param  ETPolarity   极性
  * @param  ETPrescaler  分频
  * @param  ETR_Filter   滤波
  * @param  TIM_IC_InitStruct 指向一个 @ref LL_GPTIM_IC_InitTypeDef 结构体
  * @retval  TIM_OC_InitStruct pointer to a @ref LL_GPTIM_OC_InitTypeDef structure 
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
ErrorStatus  LL_GPTIM_ETR_Init(GPTIM_Type *TIMx, LL_GPTIM_ETR_InitTypeDef* TIM_InitStruct)
{
  
    assert_param(IS_LL_GPTIM_ETP_FILTER(TIM_InitStruct->ETRFilter));
    assert_param(IS_LL_GPTIM_ETR_PSC(TIM_InitStruct->ETRClockDivision));                                                      
    assert_param(IS_LL_GPTIM_ETR_POLARITY(TIM_InitStruct->ETRPolarity));

    /* 时钟总线使能配置 */
    if(TIMx == GPTIM0)
    {
        LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_GTIM0);
    }
    else
    {
        LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_GTIM1);
    }
    /* 外部时钟极性 */
    LL_GPTIM_SetETRPolarity(TIMx,TIM_InitStruct->ETRPolarity);
    /* 外部时钟滤波 */
    LL_GPTIM_SetETRExtrenalTriggerFilter(TIMx,TIM_InitStruct->ETRFilter);
    /* 外部时钟分频 */
    LL_GPTIM_SetETRExtrenalTriggerPsc(TIMx,TIM_InitStruct->ETRClockDivision);
    if(TIM_InitStruct->AsExternal == ENABLE)
    {
        LL_GPTIM_EnableExternalClock(TIMx);
    }
    else
    {
        LL_GPTIM_DisableExternalClock(TIMx);
    }
    /* 手动触发更新事件，将配置值写入 */
    LL_GPTIM_GenerateEvent_UPDATE(TIMx);
    return PASS;
}

void LL_GPTIM_ETRStructInit(LL_GPTIM_ETR_InitTypeDef *TIM_InitStruct)
{
    TIM_InitStruct->AsExternal          = DISABLE;
    TIM_InitStruct->ETRFilter           = LL_GPTIM_ETR_FILTER_FDIV1;       
    TIM_InitStruct->ETRPolarity         = LL_GPTIM_ETR_POLARITY_NONINVERTED;     
    TIM_InitStruct->ETRClockDivision    = LL_GPTIM_ETR_PRESCALER_DIV1;
}

/**
  * @brief  配置TIM的比较输出通道.
  * @param  TIMx Timer Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_GPTIM_CHANNEL_0
  *         @arg @ref LL_GPTIM_CHANNEL_1
  *         @arg @ref LL_GPTIM_CHANNEL_2
  *         @arg @ref LL_GPTIM_CHANNEL_3
  * @retval TIM_OC_InitStruct pointer to a @ref LL_GPTIM_OC_InitTypeDef structure 
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
ErrorStatus LL_GPTIM_OC_Init(GPTIM_Type *TIMx, uint32_t Channel, LL_GPTIM_OC_InitTypeDef *TIM_OC_InitStruct)
{
    ErrorStatus result = PASS;
    /* 参数检查 */
    assert_param(IS_GPTIM_INSTANCE(TIMx)); 
    assert_param(IS_LL_GPTIM_OC_MODE(TIM_OC_InitStruct->OCMode));
    assert_param(IS_LL_GPTIM_OC_PRELOAD(TIM_OC_InitStruct->OCPreload));
    assert_param(IS_LL_GPTIM_OC_POLARITY(TIM_OC_InitStruct->OCPolarity));
    assert_param(IS_LL_GPTIM_OC_FASTMODE(TIM_OC_InitStruct->OCFastMode));
    assert_param(IS_LL_GPTIM_OC_ETR_CLEARN(TIM_OC_InitStruct->OCETRFStatus));  
    /* 通道关闭 */
    LL_GPTIM_DisableNormalChannelOutput(TIMx,Channel);
    /* 通道极性 */
    LL_GPTIM_SetOCPolartyChannel(TIMx,TIM_OC_InitStruct->OCPolarity,Channel);
    /* 捕获映射到输出通道 */
    LL_GPTIM_SetChannelMode(TIMx,LL_GPTIM_CC_MODE_OUTPUT,Channel);
    /* 输出比较模式寄存器配置 */
    OCConfig(TIMx,Channel,TIM_OC_InitStruct);
    /* 通道使能 */
    LL_GPTIM_EnableNormalChannelOutput(TIMx,Channel);
    /* 手动触发更新事件，将配置值写入 */
    LL_GPTIM_GenerateEvent_UPDATE(TIMx);
    return result;
}
/**
  * @brief	配置
  * @param  TIMx Timer Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_GPTIM_CHANNEL_0
  *         @arg @ref LL_GPTIM_CHANNEL_1
  *         @arg @ref LL_GPTIM_CHANNEL_2
  *         @arg @ref LL_GPTIM_CHANNEL_3 
  * @param 	TIM_ICInitStruct 指向需要将值设置为默认配置的结构体 @ref LL_GPTIM_IC_InitTypeDef 结构体包含配置参数.
  * @retval	None
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
static ErrorStatus OCConfig(GPTIM_Type *TIMx, uint32_t Channel,LL_GPTIM_OC_InitTypeDef *TIM_OC_InitStruct)
{
    ErrorStatus result = PASS;
    
    /* 配置比较输出通道模式 */
    LL_GPTIM_SetOCMode(TIMx,TIM_OC_InitStruct->OCMode,Channel);
    /* 配置TRF清零使能 */
    if(TIM_OC_InitStruct->OCETRFStatus == ENABLE)
    {
        LL_GPTIM_Enable_Clear(TIMx,Channel);
    }
    /* 比较输出通道快速模式 */
    if(TIM_OC_InitStruct->OCFastMode == ENABLE )
    {
        LL_GPTIM_Enable_FastCompare(TIMx,Channel);
    }
    /* 比较输出通道缓冲模式 */
    if(TIM_OC_InitStruct->OCPreload == ENABLE)
    {
        LL_GPTIM_Enable_Preload(TIMx,Channel);
    }
    /* 设置比较值 */
    switch(Channel)
    {
        case LL_GPTIM_CHANNEL_1:
            LL_GPTIM_SetCompareCH1(TIMx,TIM_OC_InitStruct->CompareValue);
            break;
        case LL_GPTIM_CHANNEL_2:
            LL_GPTIM_SetCompareCH2(TIMx,TIM_OC_InitStruct->CompareValue);
            break;
        case LL_GPTIM_CHANNEL_3:
            LL_GPTIM_SetCompareCH3(TIMx,TIM_OC_InitStruct->CompareValue);
            break;
        case LL_GPTIM_CHANNEL_4:
            LL_GPTIM_SetCompareCH4(TIMx,TIM_OC_InitStruct->CompareValue);
            break;
        default :
            result = FAIL;
            break;

