xdu-aero-association/FM33LC0XX_Example_0.04/RTC 读写时间/Drivers/FM33LC0xx_LL_Driver/Src/fm33lc0xx_ll_gptim.c
    }
    return result;
}
/**
  * @brief	设置 LL_GPTIM_OC_InitTypeDef 为默认配置
  * @param 	TIM_OC_InitStruct 指向需要将值设置为默认配置的结构体 @ref LL_GPTIM_OC_InitTypeDef 结构体  
  *         
  * @retval	None
  */
void LL_GPTIM_OC_StructInit(LL_GPTIM_OC_InitTypeDef *TIM_OC_InitStruct)
{
  /* Set the default configuration */
  TIM_OC_InitStruct->OCMode       = LL_GPTIM_OC_MODE_FROZEN;
  TIM_OC_InitStruct->OCETRFStatus = DISABLE;
  TIM_OC_InitStruct->OCFastMode   = DISABLE;
  TIM_OC_InitStruct->CompareValue = 0x00000000U;
  TIM_OC_InitStruct->OCPolarity   = LL_GPTIM_OC_POLARITY_NOMAL;
  TIM_OC_InitStruct->OCPreload    = DISABLE;

}
/**
  * @brief  配置TIM的输入捕获通道.
  * @param  TIMx Timer Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_GPTIM_CHANNEL_0
  *         @arg @ref LL_GPTIM_CHANNEL_1
  *         @arg @ref LL_GPTIM_CHANNEL_2
  *         @arg @ref LL_GPTIM_CHANNEL_3
  * @param  TIM_IC_InitStruct 指向一个 @ref LL_GPTIM_IC_InitTypeDef 结构体
  * @retval  TIM_OC_InitStruct pointer to a @ref LL_GPTIM_OC_InitTypeDef structure 
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
ErrorStatus LL_GPTIM_IC_Init(GPTIM_Type *TIMx, uint32_t Channel, LL_GPTIM_IC_InitTypeDef* InitStruct)
{
    ErrorStatus result = PASS;
    
    /* 参数检查 */
    assert_param(IS_LL_GPTIM_CHANNEL(Channel));
    assert_param(IS_LL_GPTIM_IC_CAPTURE_STATE(InitStruct->CaptureState));
    assert_param(IS_LL_GPTIM_IC_POLARITY(InitStruct->ICPolarity));
    assert_param(IS_LL_GPTIM_IC_ACTIVEINPUT(InitStruct->ICActiveInput));                             
    assert_param(IS_LL_GPTIM_IC_PRESCALER(InitStruct->ICPrescaler));
    assert_param(IS_LL_GPTIM_IC_FILTER(InitStruct->ICFilter));
    /* 时钟总线使能配置 */
    if(TIMx == GPTIM0)
    {
        LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_GTIM0);
    }
    else
    {
        LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_GTIM1);
    }  
    /* 通道关闭 */
    LL_GPTIM_DisableNormalChannelOutput(TIMx,Channel);
    /*捕获极性 */
    LL_GPTIM_SetICPolartyChannel(TIMx,InitStruct->ICPolarity,Channel);
    /* 捕获映射通道 */
    LL_GPTIM_SetChannelMode(TIMx,InitStruct->ICActiveInput,Channel);
    /* 捕获预分频 */
    LL_GPTIM_SetICModePrescaler(TIMx,InitStruct->ICPrescaler,Channel);
    /* 捕获滤波器 */
    LL_GPTIM_SetICModeFilter(TIMx,InitStruct->ICFilter,Channel);
    if(InitStruct->CaptureState == ENABLE)
    {
        LL_GPTIM_EnableChannelCapture(TIMx,Channel);
    }
    /* 手动触发更新事件，将配置值写入 */
    LL_GPTIM_GenerateEvent_UPDATE(TIMx);
    return result;
}

/**
  * @brief	设置 LL_GPTIM_IC_InitTypeDef 为默认配置
  * @param 	TIM_ICInitStruct 指向需要将值设置为默认配置的结构体 @ref LL_GPTIM_IC_InitTypeDef 结构体  
  *         
  * @retval	None
  */
void LL_GPTIM_IC_StructInit(LL_GPTIM_IC_InitTypeDef *TIM_ICInitStruct)
{
  /* Set the default configuration */  
  TIM_ICInitStruct->ICPolarity    = LL_GPTIM_IC_POLARITY_RISING;
  TIM_ICInitStruct->ICActiveInput = LL_GPTIM_CC1_MODE_INPUT_TI1;
  TIM_ICInitStruct->ICPrescaler   = LL_GPTIM_IC_PRESCALER_DIV_1;
  TIM_ICInitStruct->ICFilter      = LL_GPTIM_IC_FILTER_FDIV1;
  TIM_ICInitStruct->CaptureState  = DISABLE;
}
/**
  * @}
  */
/**
* @}
*/
/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-10-21**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
